---
type: FieldDomainPoints
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 2
tags: [revit-api, class]
---

# FieldDomainPoints

`Autodesk.Revit.DB.Analysis.FieldDomainPoints` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |